tutorials/fluidSolidInteraction/womersleyTube/0/fluid/U.robin
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/system/womersleyCode"

dimensions      [0 1 -1 0 0 0 0];

internalField   #codeStream
{
    codeInclude     $womersleyCodeInclude;
    codeOptions     $womersleyCodeOptions;
    codeLibs        $womersleyCodeLibs;
    code            $womersleyInitialVelocity;
};

boundaryField
{
    "inlet|outlet"
    {
        type            codedMixed;
        refValue        uniform (0 0 0);
        refGradient     uniform (0 0 0);
        valueFraction   uniform 0;
        value           uniform (0 0 0);
        name            womersleyVelocity;
        codeInclude     $womersleyCodeInclude;
        code            $womersleyVelocityGradient;
    }
    interface
    {
        type            elasticWallVelocity;
        value           uniform (0 0 0);
    }
    "front|back"
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}

// ************************************************************************* //
