tutorials/fluidSolidInteraction/womersleyTube/0/fluid/p.robin
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/system/womersleyCode"

dimensions      [0 2 -2 0 0 0 0];

internalField   #codeStream
{
    codeInclude     $womersleyCodeInclude;
    codeOptions     $womersleyCodeOptions;
    codeLibs        $womersleyCodeLibs;
    code            $womersleyInitialPressure;
};

boundaryField
{
    "inlet|outlet"
    {
        type            codedFixedValue;
        value           uniform 0;
        name            womersleyPressure;
        codeInclude     $womersleyCodeInclude;
        code            $womersleyPressure;
    }
    interface
    {
        type            elasticWallPressure;
        value           uniform 0;
    }
    "front|back"
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}

// ************************************************************************* //
