tutorials/fluidSolidInteraction/womersleyTube/0/solid/D_0_0_0
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      D_0_0_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/system/womersleyCode"

dimensions      [0 1 0 0 0 0 0];

// The exact solution 3 time-steps before the start
womersleyTimeLevel 3;

internalField   #codeStream
{
    codeInclude     $womersleyCodeInclude;
    codeOptions     $womersleyCodeOptions;
    codeLibs        $womersleyCodeLibs;
    code            $womersleyInitialDisplacement;
};

boundaryField
{
    "inlet|outlet"
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    interface
    {
        type            solidTraction;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
    }
    outer
    {
        type            solidTraction;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
    }
    "front|back"
    {
        type            solidWedge;
        patchType       wedge;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
