tutorials/fluidSolidInteraction/womersleyTube/0/solid/pointD
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/system/womersleyCode"

dimensions      [0 1 0 0 0 0 0];

internalField   #codeStream
{
    codeInclude     $womersleyCodeInclude;
    codeOptions     $womersleyCodeOptions;
    codeLibs        $womersleyCodeLibs;
    code            $womersleyInitialPointDisplacement;
};

boundaryField
{
    "inlet|outlet|interface|outer"
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    "front|back"
    {
        type            wedge;
    }
}

// ************************************************************************* //
