tutorials/fluidSolidInteraction/womersleyTube/constant/fsiProperties
fsiProperties.iqnils