tutorials/fluidSolidInteraction/womersleyTube/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel     linearGeometryTotalDisplacement;

linearGeometryTotalDisplacementCoeffs
{
    // Solution algorithm
    solutionAlgorithm PETScSNES;

    // Predictor D at the start of a new time step using U and A
    predictor yes;

    // On the coarser meshes the SNES residual can stall at a round-off
    // level, about 1e-6 of the cell forces, before the relative tolerance is
    // met; the solid then continues from the last iterate, and the coupling
    // tolerance decides convergence
    stopOnPetscError false;

    // Stabilisation
    stabilisation
    {
        momentum
        {
            type        diffStencilLaplacian;
            scaleFactor 0.5;
        }
    }
}

// ************************************************************************* //
