tutorials/fluidSolidInteraction/womersleyTube/constant/womersleyProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      womersleyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Generated by verification/scripts/womersley_exact.py from the
// parameters in that script: do not edit by hand

omega           1.2566370614359174e-01;
k               (1.4397837071646385e-01 -2.0726589651181286e-02);
s               (3.5459188687544887e+00 3.5430552414651273e+00);
A               (1.0000000000000000e-03 0.0000000000000000e+00);
B               (1.7303312779256988e-04 -3.4836855520015694e-05);
innerRadius     1.0000000000000000e+00;
outerRadius     1.1000000000000001e+00;

// Radial and axial wall displacement at the Chebyshev points
// r = Ri + (1 + cos(pi j/N)) (Ro - Ri)/2, j = 0..N
solidRadialDisplacement
(
    (5.0759167573464364e-04 2.0065725611366618e-05)
    (5.0774705793397447e-04 2.0047705459240998e-05)
    (5.0821028697530554e-04 1.9994340969277192e-05)
    (5.0897233293483476e-04 1.9907692642140035e-05)
    (5.1001726946804085e-04 1.9791104509439779e-05)
    (5.1132112440637400e-04 1.9649073023600239e-05)
    (5.1285059408762081e-04 1.9487071417940035e-05)
    (5.1456192456783090e-04 1.9311336852151826e-05)
    (5.1640031172582818e-04 1.9128628986549335e-05)
    (5.1830018047221884e-04 1.8945969526333402e-05)
    (5.2018665411129254e-04 1.8770372765320976e-05)
    (5.2197840568659606e-04 1.8608577282576253e-05)
    (5.2359189258330350e-04 1.8466788755556761e-05)
    (5.2494673132486827e-04 1.8350443386903499e-05)
    (5.2597171162005192e-04 1.8264000712457789e-05)
    (5.2661073626243877e-04 1.8210773557045303e-05)
    (5.2682787030074174e-04 1.8192801615532720e-05)
);

solidAxialDisplacement
(
    (5.0489877101614193e-04 -5.1560749893170797e-04)
    (5.0489144798404855e-04 -5.1567811263134044e-04)
    (5.0486986519324660e-04 -5.1588725714264922e-04)
    (5.0483515122996955e-04 -5.1622694699729780e-04)
    (5.0478908934789883e-04 -5.1668421562182042e-04)
    (5.0473398227704382e-04 -5.1724161191722370e-04)
    (5.0467248426104756e-04 -5.1787786317256460e-04)
    (5.0460741835443553e-04 -5.1856867651216200e-04)
    (5.0454159794385107e-04 -5.1928764826961041e-04)
    (5.0447766996491842e-04 -5.2000724981806604e-04)
    (5.0441799354486048e-04 -5.2069985841188748e-04)
    (5.0436456228763939e-04 -5.2133880132761200e-04)
    (5.0431897187549893e-04 -5.2189938016775463e-04)
    (5.0428242802568303e-04 -5.2235983947773192e-04)
    (5.0425578413720059e-04 -5.2270224064619459e-04)
    (5.0423959414897413e-04 -5.2291320006516773e-04)
    (5.0423416492207393e-04 -5.2298445169653184e-04)
);

// ************************************************************************* //
