tutorials/fluidSolidInteraction/womersleyTube/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     solids4Foam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// Two periods of 50 s, starting from the exact solution; the second period
// is compared with the exact solution
endTime         100;

deltaT          0.5;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  no;

functions
{
    // Wall displacement at x = L/4, L/2 and 3L/4, on the inner surface
    wallQuarter
    {
        type                solidPointDisplacement;
        point               (3.75 0.9999619231 -0.008726535498);
    }
    wallMid
    {
        type                solidPointDisplacement;
        point               (7.5 0.9999619231 -0.008726535498);
    }
    wallThreeQuarter
    {
        type                solidPointDisplacement;
        point               (11.25 0.9999619231 -0.008726535498);
    }

    // Fluid velocity and pressure ten times per period over the second
    // period: the radial velocity profile as the values of the cells just
    // downstream of x = L/2 (a face plane), whose centres are at
    // x = L/2 + dx/2, and the pressure along the tube at r = R/2
    profileSamples
    {
        type                sets;
        libs                (sampling);
        region              fluid;
        timeStart           50;
        writeControl        timeStep;
        writeInterval       10;
        interpolationScheme cell;
        setFormat           raw;
        fields              (U p);
        sets
        {
            profile
            {
                type        midPoint;
                axis        distance;
                start       (7.53 0 0);
                end         (7.53 1.01 0);
            }
        }
    }
    axialSamples
    {
        type                sets;
        libs                (sampling);
        region              fluid;
        timeStart           50;
        writeControl        timeStep;
        writeInterval       10;
        interpolationScheme cellPoint;
        setFormat           raw;
        fields              (U p);
        sets
        {
            axial
            {
                type        uniform;
                axis        x;
                start       (0 0.5 0);
                end         (15 0.5 0);
                nPoints     61;
            }
        }
    }

    // Volumetric flow rate through the 1 degree wedge at x = L/2 (the faceZone
    // is made by topoSet), from the velocity, as the flux phi is relative to
    // the moving mesh; the flow rate of the whole tube is 360 times this
    flowRate
    {
        type                surfaceFieldValue;
        libs                (fieldFunctionObjects);
        region              fluid;
        writeControl        timeStep;
        writeInterval       1;
        log                 false;
        writeFields         false;
        regionType          faceZone;
        name                midPlane;
        operation           areaNormalIntegrate;
        fields              (U);
    }
}

// ************************************************************************* //
