tutorials/fluidSolidInteraction/womersleyTube/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Axisymmetric wedge of the fluid, 1 degree wide, about the x axis. The x axis
// is the tube axis and y the radial direction

nAxial      64;
nRadial     20;

vertices
(
    (0 0 0)
    (0 0.9999619231 -0.008726535498)
    (0 0.9999619231 0.008726535498)
    (15 0 0)
    (15 0.9999619231 -0.008726535498)
    (15 0.9999619231 0.008726535498)
);

blocks
(
    hex (0 3 4 1 0 3 5 2) ($nAxial $nRadial 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 0 2 1));
    }
    outlet
    {
        type patch;
        faces ((3 4 5 3));
    }
    interface
    {
        type wall;
        faces ((1 4 5 2));
    }
    front
    {
        type wedge;
        faces ((0 3 4 1));
    }
    back
    {
        type wedge;
        faces ((0 2 5 3));
    }
    axis
    {
        type empty;
        faces ((0 3 3 0));
    }
);

// ************************************************************************* //
